app/controllers/pins_controller.rb

INSERT INTO "pins" ("description", "string", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "this pin has user"], ["string", "test-pin"], ["user_id", 3], ["created_at", "2016-01-31 23:01:25.671900"], ["updated_at", "2016-01-31 23:01:25.671900"]]
---
  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save